lib/soapy_bing/soap/templates/poll_generate_report.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xmlns:tns="https://bingads.microsoft.com/Reporting/v11"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
    <env:Header>
        <tns:CustomerAccountId><%= account.account_id %></tns:CustomerAccountId>
        <tns:CustomerId><%= account.customer_id %></tns:CustomerId>
        <tns:DeveloperToken><%= account.developer_token %></tns:DeveloperToken>
        <tns:AuthenticationToken><%= authentication_token %></tns:AuthenticationToken>
    </env:Header>
    <env:Body>
        <tns:PollGenerateReportRequest>
            <tns:ReportRequestId xsi:nil="false"><%= request_id %></tns:ReportRequestId>
        </tns:PollGenerateReportRequest>
    </env:Body>
</env:Envelope>
